In [3]:
import numpy as np
import pandas as pd

In [16]:
dataset = {
    "Çalışan":["@hllbr","@prince","h2lbr","şehzade","east devil","Ryze"],
    "Departman":["BİLİŞİM","CEO","İNSAN KAYNAKLARI","ÜRETİM","BİLİŞİM","ÜRETİM"],
    "MAAŞ": [100000,500,250,275,1000,260]
}

In [17]:
df = pd.DataFrame(dataset)

In [18]:
df

      Çalışan         Departman    MAAŞ
0      @hllbr           BİLİŞİM  100000
1     @prince               CEO     500
2       h2lbr  İNSAN KAYNAKLARI     250
3     şehzade            ÜRETİM     275
4  east devil           BİLİŞİM    1000
5        Ryze            ÜRETİM     260

In [19]:
DepGroup = df.groupby("Departman")

In [20]:
DepGroup

In [21]:
DepGroup.sum()

                    MAAŞ
Departman
BİLİŞİM           101000
CEO                  500
ÜRETİM               535
İNSAN KAYNAKLARI     250

In [22]:
df.groupby("Departman").sum()

                    MAAŞ
Departman
BİLİŞİM           101000
CEO                  500
ÜRETİM               535
İNSAN KAYNAKLARI     250

In [23]:
df.groupby("Departman").sum().loc["İNSAN KAYNAKLARI"]

MAAŞ    250
Name: İNSAN KAYNAKLARI, dtype: int64

In [24]:
int(df.groupby("Departman").sum().loc["İNSAN KAYNAKLARI"])

250

In [25]:
int(df.groupby("Departman").sum().loc["BİLİŞİM"])

101000

In [26]:
df.groupby("Departman").count()

                  Çalışan  MAAŞ
Departman
BİLİŞİM                 2     2
CEO                     1     1
ÜRETİM                  2     2
İNSAN KAYNAKLARI        1     1

In [28]:
#herbir departmanda kaç adet kişi ve maaş yükünün olduğunu hesaplayabiliyoruz .count() ile

In [29]:
df.groupby("Departman").max()

                     Çalışan    MAAŞ
Departman
BİLİŞİM           east devil  100000
CEO                  @prince     500
ÜRETİM               şehzade     275
İNSAN KAYNAKLARI       h2lbr     250

In [30]:
#kendi birimlerinde en yüksek maaş alan çalışanların listesi

In [31]:
df.groupby("Departman").min()

                  Çalışan  MAAŞ
Departman
BİLİŞİM            @hllbr  1000
CEO               @prince   500
ÜRETİM               Ryze   260
İNSAN KAYNAKLARI    h2lbr   250

In [33]:
df.groupby("Departman").min()["MAAŞ"]

Departman
BİLİŞİM             1000
CEO                  500
ÜRETİM               260
İNSAN KAYNAKLARI     250
Name: MAAŞ, dtype: int64

In [34]:
df.groupby("Departman").min()["MAAŞ"]["BİLİŞİM"]

1000

In [36]:
df.groupby("Departman").mean()["MAAŞ"]["BİLİŞİM"]

50500.0